content/posts/Gauge_Theories_in_Particle_Physics_A_Practical_Introduction,_Volume_2_Non-Abelian_Gauge_Theories_QCD_and_The_Electroweak_Theory_by_Aitchison_and_Hey_in_2013.md
+++
title = "Gauge Theories in Particle Physics A Practical Introduction, Volume 2 Non-Abelian Gauge Theories QCD and The Electroweak Theory by Aitchison and Hey in 2013"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:34:32-04:00
slug = "Gauge_Theories_in_Particle_Physics_A_Practical_Introduction,_Volume_2_Non-Abelian_Gauge_Theories_QCD_and_The_Electroweak_Theory_by_Aitchison_and_Hey_in_2013"
draft = false
+++

## V. Non-Abelian Symmetries {#v-dot-non-abelian-symmetries}


### 12. Global Non-Abelian Symmetries {#12-dot-global-non-abelian-symmetries}

<!--list-separator-->

-  12.1 The Standard Model

<!--list-separator-->

-  12.2 The flavor symmetry \\[SU(2)\_f\\]

    <!--list-separator-->

    -  12.2.1 The nucleon isospin doublet and the group \\[SU(2)\\]

    <!--list-separator-->

    -  12.2.2 Larger (higher-dimensional) multiplets of \\[SU(2)\\] in nuclear physics

    <!--list-separator-->

    -  12.2.3 Isospin in particle physics: flavor \\[SU(2)\_f\\]

<!--list-separator-->

-  12.3 Flavor \\[SU(3)\_f\\]

<!--list-separator-->

-  12.4 Non-Abelian global symmetries in Lagrangian quantum field theory

    <!--list-separator-->

    -  12.4.1 \\[SU(2)\_f\\] and \\[SU(3)\_f\\]

    <!--list-separator-->

    -  12.4.2 Chiral symmetry

    <!--list-separator-->

    -  Problems


### 13. Local Non-Abelian (Gauge) Symmetries {#13-dot-local-non-abelian--gauge--symmetries}

<!--list-separator-->

-  13.1 Local \\[SU(2)\\] symmetry

    <!--list-separator-->

    -  13.1.1 The covariant derivative and interactions with matter

    <!--list-separator-->

    -  13.1.2 The non-Abelian field strength tensor

<!--list-separator-->

-  13.2 Local \\[SU(3)\\] symmetry

<!--list-separator-->

-  13.3 Local non-Abelian symmetries in Lagrangian quantum field theory

    <!--list-separator-->

    -  13.3.1 Local \\[SU(2)\\] and \\[SU(3)\\] Lagrangians

    <!--list-separator-->

    -  13.3.2 Gauge field self-interactions

    <!--list-separator-->

    -  13.3.3 Quantizing non-Abelian gauge fields

    <!--list-separator-->

    -  Problems


## VI. QCD and the Renormalization Group {#vi-dot-qcd-and-the-renormalization-group}


### 14. QCD I: Introduction, Tree Graph Predictions, and Jets {#14-dot-qcd-i-introduction-tree-graph-predictions-and-jets}

<!--list-separator-->

-  14.1 The color degree of freedom

<!--list-separator-->

-  14.2 The dynamics of color

    <!--list-separator-->

    -  14.2.1 Color as an \\[SU(3)\\] group

    <!--list-separator-->

    -  14.2.2 Global \\[SU(3)\_c\\] invariance, and 'scalar gluons'

    <!--list-separator-->

    -  14.2.3 Local \\[SU(3)\_c\\] invariance: the QCD Lagrangian

    <!--list-separator-->

    -  14.2.4 The \\[\theta\\]-term

<!--list-separator-->

-  14.3 Hard scattering processes, QCD tree graphs, and jets

    <!--list-separator-->

    -  14.3.1 Introduction

    <!--list-separator-->

    -  14.3.2 Two-jet events in \\[\bar{p}p\\] collisions

    <!--list-separator-->

    -  14.3.3 Three-jet events in \\[\bar{p}p\\] collisions

<!--list-separator-->

-  14.4 3-jet events in \\[e^+e^-\\] annihilation

    <!--list-separator-->

    -  14.4.1 Calculation of the parton-level cross section

    <!--list-separator-->

    -  14.4.2 Soft and collinear divergences

<!--list-separator-->

-  14.5 Definition of the two-jet cross section in \\[e^+e^-\\] annihilation

<!--list-separator-->

-  14.6 Further developments

    <!--list-separator-->

    -  14.6.1 Test of non-Abelian nature of QCD in \\[e^+e^\* \rightarrow 4\\] jets

    <!--list-separator-->

    -  14.6.2 Jet algorithms

    <!--list-separator-->

    -  Problems


### 15. QCD II: Asymptotic freedom, the Renormalization Group, and Scaling Violations {#15-dot-qcd-ii-asymptotic-freedom-the-renormalization-group-and-scaling-violations}

<!--list-separator-->

-  15.1 Higher-order QCD corrections to \\[\sigma (e^+e^\* \rightarrow \mathrm{hadrons})\\]: large logarithms

<!--list-separator-->

-  15.2 The renormalization group and related ideas in QED

    <!--list-separator-->

    -  15.2.1 Where do the large logs come from?

    <!--list-separator-->

    -  15.2.2 Changing the renormalization scale

    <!--list-separator-->

    -  15.2.3 The RGE and large \\[-q^2\\] behavior in QED

<!--list-separator-->

-  15.3 Back to QCD: asymptotic freedom

    <!--list-separator-->

    -  15.3.1 One loop calculation

    <!--list-separator-->

    -  15.3.2 Higher-order calculations, and experimental comparison

<!--list-separator-->

-  15.4 \\[\sigma (e^+e^\* \rightarrow \mathrm{hadrons})\\] revisited

<!--list-separator-->

-  15.5 A more general form of the RGE: anomalous dimensions and running masses

<!--list-separator-->

-  15.6 QCD corrections to the parton model predictions for deep inelastic scattering: scaling violations

    <!--list-separator-->

    -  15.6.1 Uncancelled mass singularities at order \\[\alpha\_s\\]

    <!--list-separator-->

    -  15.6.2 Factorization, and the order \\[\alpha\_s\\] DGLAP equation

    <!--list-separator-->

    -  15.6.3 Comparison with experiment

    <!--list-separator-->

    -  Problems


### 16. Lattice Field Theory, and the Renormalization Group Revisited {#16-dot-lattice-field-theory-and-the-renormalization-group-revisited}

<!--list-separator-->

-  16.1 Introduction

<!--list-separator-->

-  16.2 Discretization

    <!--list-separator-->

    -  16.2.1 Scalar fields

    <!--list-separator-->

    -  16.2.2 Dirac fields

    <!--list-separator-->

    -  16.2.3 Gauge fields

<!--list-separator-->

-  16.3 Representation of quantum amplitudes

    <!--list-separator-->

    -  16.3.1 Quantum mechanics

    <!--list-separator-->

    -  16.3.2 Quantum field theory

    <!--list-separator-->

    -  16.3.3 Connection with statistical mechanics

<!--list-separator-->

-  16.4 Renormalization, and the renormalization group, on the lattice

    <!--list-separator-->

    -  16.4.1 Introduction

    <!--list-separator-->

    -  16.4.2 Two one-dimensional examples

    <!--list-separator-->

    -  16.4.3 Connections with particle physics

<!--list-separator-->

-  16.5 Lattice QCD

    <!--list-separator-->

    -  16.5.1 Introduction and the continuum limit

    <!--list-separator-->

    -  16.5.2 The static \\[q\bar{q}\\] potential

    <!--list-separator-->

    -  16.5.3 Calculation of \\[\alpha (M\_Z^2)\\]

    <!--list-separator-->

    -  16.5.4 Hadron masses

    <!--list-separator-->

    -  Problems


## VII. Spontaneously broken symmetry {#vii-dot-spontaneously-broken-symmetry}


### 17. Spontaneously broken global symmetry {#17-dot-spontaneously-broken-global-symmetry}

<!--list-separator-->

-  17.1 Introduction

<!--list-separator-->

-  17.2 The Fabri-Picasso theorem

<!--list-separator-->

-  17.3 Spontaneously broken symmetry in condensed matter physics

<!--list-separator-->

-  17.4 Goldstone's theorem

<!--list-separator-->

-  17.5 Spontaneously broken global U(1) symmetry: the Goldstone model

<!--list-separator-->

-  17.6 Spontaneously broken global non-Abelian symmetry

<!--list-separator-->

-  17.7 The BCS superconducting ground state

<!--list-separator-->

-  Problems


### 18. Chiral symmetry breaking {#18-dot-chiral-symmetry-breaking}

<!--list-separator-->

-  18.1 The Nambu analogy

    <!--list-separator-->

    -  18.1.1 Two flavor QCD and \\[SU(2)\_{f\,L} \times SU(2)\_{f\,R}\\]

<!--list-separator-->

-  18.2 Pion decay and the Goldberger-Treiman relation

<!--list-separator-->

-  18.3 Effective Lagrangians

    <!--list-separator-->

    -  18.3.1 The linear and non-linear \\[\sigma\\]-models

    <!--list-separator-->

    -  18.3.2 Inclusion of explicit symmetry breaking: masses for pions and quarks

    <!--list-separator-->

    -  18.3.3 Extension to \\[SU(3)\_{f\,L} \times SU(3)\_{f\,R}\\]

<!--list-separator-->

-  18.4 Chiral anomalies


### 19. Spontaneously broken local symmetry {#19-dot-spontaneously-broken-local-symmetry}

<!--list-separator-->

-  19.1 Massive and massless vector particles

<!--list-separator-->

-  19.2 The generation of 'photon mass in a superconductor: Ginzburg-Landau theory and the Meissner effect

<!--list-separator-->

-  19.3 Spontaneously broken local U(1) symmetry: the Abelian Higgs model

<!--list-separator-->

-  19.4 Flux quantization in a superconductor

<!--list-separator-->

-  19.5 't Hooft's gauges

<!--list-separator-->

-  19.6 Spontaneously broken local \\[SU(2) \times U(1)\\] symmetry


## VIII. Weak interactions and the electroweak theory {#viii-dot-weak-interactions-and-the-electroweak-theory}


### 20. Introduction to the phenomenology of weak interactions {#20-dot-introduction-to-the-phenomenology-of-weak-interactions}

<!--list-separator-->

-  20.1 Fermi's 'current-current' theory of nuclear \\[\beta\\] decay and its generalizations

<!--list-separator-->

-  20.2 Parity violation in weak interactions and V-A theory

    <!--list-separator-->

    -  20.2.1 Parity violation

    <!--list-separator-->

    -  20.2.2 V-A theory: chirality and helicity

<!--list-separator-->

-  20.3 Lepton number and lepton flavors

<!--list-separator-->

-  20.4 The universal current \\[\times\\] current theory for weak interactions of leptons

<!--list-separator-->

-  20.5 Calculation of the cross section for \\[\nu\_\mu + e^\* \rightarrow \mu^\* + \nu\_e\\]

<!--list-separator-->

-  20.6 Leptonic weak neutral currents

<!--list-separator-->

-  20.7 Quark weak currents

    <!--list-separator-->

    -  20.7.1 Two generations

    <!--list-separator-->

    -  20.7.2 Deep inelastic neutrino scattering

    <!--list-separator-->

    -  20.7.3 Three generations

<!--list-separator-->

-  20.8 Non-leptonic weak interactions


### 21. CP violation and oscillation phenomena {#21-dot-cp-violation-and-oscillation-phenomena}

<!--list-separator-->

-  21.1 Direct \\[\mathbf{CP}\\] violation in B decays

<!--list-separator-->

-  21.2 \\[\mathbf{CP}\\] violation in B meson oscillations

<!--list-separator-->

-  21.3 \\[\mathbf{CP}\\] violation in neutral K-meson decays

<!--list-separator-->

-  21.4 Neutrino mixing and oscillations

    <!--list-separator-->

    -  21.4.1 Neutrino mass and mixing

    <!--list-separator-->

    -  21.4.2 Neutrino oscillations: formulae

    <!--list-separator-->

    -  21.4.3 Neutrino oscillations: experimental results

    <!--list-separator-->

    -  21.4.4 Matter effects in neutrino oscillations

    <!--list-separator-->

    -  21.4.5 Further developments


### 22. Glashow-Salam-Weinberg gauge theory of electroweak interactions {#22-dot-glashow-salam-weinberg-gauge-theory-of-electroweak-interactions}

<!--list-separator-->

-  22.1 Difficulties with the current-current and 'naive' IVB models

    <!--list-separator-->

    -  22.1.1 Violations of unitarity

    <!--list-separator-->

    -  22.1.2 The problem of non-renormalizability in weak interactions

<!--list-separator-->

-  22.2 The \\[SU(2) \times U(1)\\] electroweak gauge theory

    <!--list-separator-->

    -  22.2.1 Quantum number assignments; Higgs, W and Z masses

    <!--list-separator-->

    -  22.2.2 The leptonic currents (massless neutrinos): relation to current-current model

    <!--list-separator-->

    -  22.2.3 The quark currents

<!--list-separator-->

-  22.3 Simple (tree-level) predictions

<!--list-separator-->

-  22.4 The discovery of the \\[W^{\pm}\\] and Z^0 at the CERN \\[p\bar{p}\\] collider

    <!--list-separator-->

    -  22.4.1 Production cross sections for W and Z in \\[p\bar{p}\\] colliders

    <!--list-separator-->

    -  22.4.2 Charge asymmetry in \\[W^{\pm}\\] decay

    <!--list-separator-->

    -  22.4.3 Discovery of the \\[W^{\pm}\\] and \\[Z^0\\] at the \\[p\bar{p}\\] collider, and their properties

<!--list-separator-->

-  22.5 Fermion masses

    <!--list-separator-->

    -  22.5.1 One generation

    <!--list-separator-->

    -  22.5.2 Three-generation mixing

<!--list-separator-->

-  22.6 Higher-order corrections

<!--list-separator-->

-  22.7 The top quark

<!--list-separator-->

-  22.8 The Higgs sector

    <!--list-separator-->

    -  22.8.1 Introduction

    <!--list-separator-->

    -  22.8.2 Theoretical considerations concerning \\[m\_H\\]

    <!--list-separator-->

    -  22.8.3 Higgs boson searches and the 2012 discovery

    <!--list-separator-->

    -  Problems


## Appendices {#appendices}


### M. Group Theory {#m-dot-group-theory}

<!--list-separator-->

-  M.1 Definition and simple examples

<!--list-separator-->

-  M.2 Lie groups

<!--list-separator-->

-  M.3 Generators of Lie groups

<!--list-separator-->

-  M.4 Examples

    <!--list-separator-->

    -  M.4.1 SO(3) and three-dimensional rotations

    <!--list-separator-->

    -  M.4.2 SU(2)

    <!--list-separator-->

    -  M.4.3 SO(4): The special orthogonal group in four dimensions

    <!--list-separator-->

    -  M.4.4 The Lorentz group

    <!--list-separator-->

    -  M.4.5 SU(3)

<!--list-separator-->

-  M.5 Matrix representations of generators, and of Lie groups

<!--list-separator-->

-  M.6 The Lorentz group

<!--list-separator-->

-  M.7 The relation between SU(2) and SO(3)


### N. Geometrical aspects of gauge fields {#n-dot-geometrical-aspects-of-gauge-fields}

<!--list-separator-->

-  N.1 Covariant derivatives and coordinate transformations

<!--list-separator-->

-  N.2 Geometrical curvature and the gauge field strength tensor


### O. Dimensional regularization {#o-dot-dimensional-regularization}


### P. Grassmann variables {#p-dot-grassmann-variables}


### Q. Feynman rules for tree graphs in QCD and the electroweak theory {#q-dot-feynman-rules-for-tree-graphs-in-qcd-and-the-electroweak-theory}

<!--list-separator-->

-  Q.1 QCD

    <!--list-separator-->

    -  Q.1.1 External particles

    <!--list-separator-->

    -  Q.1.2 Propagators

    <!--list-separator-->

    -  Q.1.3 Vertices

<!--list-separator-->

-  Q.2 The electroweak theory

    <!--list-separator-->

    -  Q.2.1 External particles

    <!--list-separator-->

    -  Q.2.2 Propagators

    <!--list-separator-->

    -  Q.2.3 Vertices
